group_list = [
    ['IT-31', [
        'Безручко Дзвенислава',
        'Чуйко Чеслава',
        'Височан Федора',
        'Черемшинська Марічка',
        'Попогребська Сніжана',
        'Ріпецька Валерія',
        'Дурдинець Христина',
        'Нечай Тимофій',
        'Куц Афанасій',
        'Родзянко Нестор',
        'Горобчук Златоус',
        'Білоножко Пимон'
    ]],
    ['IT-32', [
        'Дубина Юлій',
        'Лесик Вернислав',
        'Рибалко Юхим',
        'Лісовська Сусанна',
        'Петрівська Світолюба',
        'Григорович-Барська Творимира',
        'Пістун Йосифата',
        'Качковська Стефанида',
        'Шимко Анфіса',
        'Веселовська Белла'
    ]],
    ['IT-33', [
        'Зубченко Ядвіга',
        'Калитовська Емілія',
        'Стойко Любомира',
        'Черська Олена',
        'Стовпченко Богуслава',
        'Носенко Йосипа',
        'Огородник Шерлок',
        'Компанець Назарій',
        'Дудченко Царко',
        'Баландюк Святополк',
        'Ярошенко Курило',
        'Бадлак Еммануїл',
        'Семенів Корній',
        'Проненко Щастислав',
        'Андрусенко Горимисл'
    ]]
]
group_name = 'IT-31'

group = []

for i in range(len(group_list)):
    if(group_list[i][0] == group_name):
        group = group_list[i]

print("Назва групи: ", group[0])
for i in group[1]:
    print(i)

